[
  {
    "id": 1,
    "author": "Isaac Asimov",
    "title": "Foundation",
    "isbn": "9780553293357",
    "reason": "Classic sci-fi with mind-blowing ideas about the future of humanity. I’ve always been curious about Asimov’s vision of psychohistory and how he blends mathematics with human behavior. This feels like one of those books that shape the genre itself.",
    "notes": "I was really drawn to the political maneuvering and the way entire civilizations rise and fall. The psychohistory concept is fascinating, almost unsettling in how it mirrors real-world history. Some parts felt dry, but then you hit a big reveal and it pulls you right back in.",
    "status": "finished",
    "stars": 5,
    "tags": ["sci-fi", "classic", "space"]
  },
  {
    "id": 2,
    "author": "J.K. Rowling",
    "title": "Harry Potter and the Philosopher's Stone",
    "isbn": "9780747532699",
    "reason": "Fun and magical, a perfect escape. I grew up with this series, but I want to reread it as an adult and see how it holds up.",
    "notes": "Reading it again feels nostalgic but also refreshing. Some parts are clearly aimed at kids, but the charm is still there. I notice little world-building details now that I never paid attention to as a child.",
    "status": "reading",
    "stars": 4,
    "tags": ["fantasy", "magic", "young adult"]
  },
  {
    "id": 3,
    "author": "George Orwell",
    "title": "1984",
    "isbn": "9780451524935",
    "reason": "Dystopian novel that makes you question society and the way power can shape truth. It feels more relevant every year, which is terrifying.",
    "notes": "The newspeak chapters are heavy but absolutely essential. The ending left me gutted — it’s not just a story, it’s a warning. Definitely a book I’ll revisit later when I need a reality check.",
    "status": "finished",
    "stars": 5,
    "tags": ["dystopia", "classic", "politics"]
  },
  {
    "id": 4,
    "author": "Frank Herbert",
    "title": "Dune",
    "isbn": "9780441013593",
    "reason": "Epic sci-fi saga with political intrigue and desert planets. People keep calling it the 'Lord of the Rings of sci-fi,' and I feel like I need to finally see why it’s such a big deal.",
    "notes": "",
    "status": "want to read",
    "stars": 0,
    "tags": ["sci-fi", "epic", "adventure"]
  },
  {
    "id": 5,
    "author": "Harper Lee",
    "title": "To Kill a Mockingbird",
    "isbn": "9780061120084",
    "reason": "A timeless story about justice and morality. I’ve always wanted to understand why this book gets referenced in so many cultural and political discussions.",
    "notes": "Scout’s narration feels both innocent and wise. The courtroom scenes are intense but it’s the quieter family and neighborhood moments that really hit me. Definitely lived up to the hype.",
    "status": "finished",
    "stars": 4,
    "tags": ["classic", "literature", "social"]
  },
  {
    "id": 6,
    "author": "Suzanne Collins",
    "title": "The Hunger Games",
    "isbn": "9780439023528",
    "reason": "Exciting dystopian world, engaging story. I loved the movies, but I want to see how the books handle the world-building and character depth.",
    "notes": "The pacing is really fast — sometimes I wanted it to slow down a little. Katniss feels more layered in the book than in the film, which makes me appreciate her character more. It’s a quick read but it sticks with you.",
    "status": "reading",
    "stars": 3,
    "tags": ["dystopia", "adventure", "young adult"]
  },
  {
    "id": 7,
    "author": "Neil Gaiman",
    "title": "American Gods",
    "isbn": "9780062572233",
    "reason": "Weird and wonderful story about mythology in modern America. I’ve heard this is one of those books that feels like a dream — confusing, beautiful, and strange all at once.",
    "notes": "Some chapters felt like I had to work hard to follow them, but then I’d hit a scene that was so vivid and mythic it gave me chills. Definitely not a casual read, but I’m glad I stuck with it.",
    "status": "want to read",
    "stars": 0,
    "tags": ["fantasy", "mythology", "adult"]
  },
  {
    "id": 8,
    "author": "Brandon Sanderson",
    "title": "Mistborn: The Final Empire",
    "isbn": "9780765311788",
    "reason": "Unique magic system and engaging heist story. I want to dive into Sanderson’s universe because everyone raves about his world-building and plot twists. Plus, I’m curious about how he pulls off such a long series.",
    "notes": "This was a ride. The Allomancy system is so clever and well thought out. The ending caught me off guard, and the characters really grew on me. Feels like the start of a massive universe I’ll want to keep exploring.",
    "status": "finished",
    "stars": 5,
    "tags": ["fantasy", "magic", "epic"]
  }
]
